[
    {
        "id": 1,
        "title": "ChainOps Ai",
        "description": "ChainOps AI is an AI-driven operations dashboard for blockchain infrastructure. It continuously monitors node health, analyzes telemetry, and predicts failures in real time. An intelligent agent recommends and executes remediation actions when issues occur. Every decision and action is logged on-chain (Monad) for transparency and auditability.",
        "tags": [
            "Next.js (React)",
            "TypeScript",
            "Tailwind CSS",
            "Node.js",
            "SQLite3",
            "Solidity",
            "WebSockets",
            "AI agent logic",
            "On-chain logging (Monad)"
        ],
        "image": "/images/project1.png",
        "demo": "https://lnm-rosy.vercel.app/",
        "github": "https://github.com/atharvix/lnm",
        "impact": "Enables self-healing, transparent, and trust-verifiable blockchain infrastructure managed by autonomous AI agents."
    },
    {
        "id": 2,
        "title": "Ention",
        "description": "Developed and deployed the official website for Ention as a Web Development Intern, focusing on performance, accessibility, and modern UI/UX. Built responsive pages and optimized load speed, SEO, and cross-device compatibility to improve user experience. Collaborated with the team to translate brand requirements into a scalable, production-ready web platform. The website currently attracts 5K+ monthly visitors, demonstrating real-world impact and reliability.",
        "tags": [
            "React",
            "React Router",
            "TypeScript",
            "Tailwind CSS",
            "Node.js",
            "Express",
            "JWT Authentication",
            "MongoDB",
            "SMTP Email Service",
            "Digital Payments Integration "

        ],
        "image": "/images/project2.png",
        "demo": "https://ention.in/",
        "github": "https://github.com/yashmish18/ention1",
        "impact": "Delivered a production website for Ention that serves 5,000+ monthly users with optimized performance and user experience."
    },
    {
        "id": 3,
        "title": "PillSync 360",
        "description": "PillSync 360 is an AI-powered healthcare platform that unifies medication management, digital medical records, and emergency support for patients, caregivers, and doctors. It uses OCR to digitize prescriptions, verify medicine intake, and generate adherence insights in real time. A QR-based Smart Med Card and SOS system ensure critical health data is accessible instantly during emergencies. Built with secure role-based access and real-time sync, it enables coordinated, safer care—especially for elderly and chronically ill users.",
        "tags": [
            "Next.js (React)",
            "TypeScript",
            "Node.js",
            "Firebase",
            "Real-time Sync"
        ],
        "image": "/images/project3.png",
        "demo": "https://pillsync-360.vercel.app/",
        "github": "https://github.com/atharvix/pillsync-360",
        "impact": "Improves medication adherence, emergency response, and care coordination through a unified AI-driven health management ecosystem. (Best project award at JEC Hackathon 2025)"
    },
    {
        "id": 4,
        "title": "Browser-Vigilant",
        "description": "Browser Vigilant is a privacy-first browser extension that blocks phishing and scam websites in real time using on-device AI. It combines Rust-based WebAssembly feature extraction, ONNX ML inference, and multi-layer heuristics to stop threats before users interact.",
        "tags": [
            "Chrome Extension (MV3)",
            "Rust → WASM",
            "Svelte",
            "ONNX ML",
            "Real-time URL Analysis",
            "Phishing Detection",
            "Web Crypto API",
            "IndexedDB Storage"
        ],
        "image": "/images/project4.png",
        "demo": "https://example.com/cyber-metrics",
        "github": "https://github.com/Prekshas27/Browser-Vigilant",
        "impact": "Real-time phishing protection that preserves privacy and prevents user data theft."
    }
]